OldTests/Win-wsl4core/benchmark_raw_20260510_133040/raw_logs/fio_rand_4k_raw.txt
rand_4k: (g=0): rw=randrw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=32
fio-3.39
Starting 1 process
note: both iodepth >= 1 and synchronous I/O engine are selected, queue depth will be capped at 1

rand_4k: (groupid=0, jobs=1): err= 0: pid=8681: Sun May 10 13:43:30 2026
  read: IOPS=2926, BW=11.4MiB/s (12.0MB/s)(686MiB/60001msec)
    clat (usec): min=97, max=41287, avg=242.33, stdev=213.28
     lat (usec): min=97, max=41287, avg=242.45, stdev=213.28
    clat percentiles (usec):
     |  1.00th=[  143],  5.00th=[  151], 10.00th=[  159], 20.00th=[  174],
     | 30.00th=[  217], 40.00th=[  221], 50.00th=[  223], 60.00th=[  231],
     | 70.00th=[  235], 80.00th=[  237], 90.00th=[  245], 95.00th=[  285],
     | 99.00th=[ 1401], 99.50th=[ 1795], 99.90th=[ 2245], 99.95th=[ 2311],
     | 99.99th=[ 3523]
   bw (  KiB/s): min= 7184, max=12928, per=100.00%, avg=11709.18, stdev=933.30, samples=119
   iops        : min= 1796, max= 3232, avg=2927.29, stdev=233.32, samples=119
  write: IOPS=2920, BW=11.4MiB/s (12.0MB/s)(685MiB/60001msec); 0 zone resets
    clat (usec): min=79, max=34174, avg=96.81, stdev=95.83
     lat (usec): min=79, max=34174, avg=97.01, stdev=95.84
    clat percentiles (usec):
     |  1.00th=[   86],  5.00th=[   88], 10.00th=[   89], 20.00th=[   90],
     | 30.00th=[   92], 40.00th=[   93], 50.00th=[   94], 60.00th=[   95],
     | 70.00th=[   95], 80.00th=[   96], 90.00th=[  103], 95.00th=[  122],
     | 99.00th=[  147], 99.50th=[  163], 99.90th=[  262], 99.95th=[  343],
     | 99.99th=[ 1762]
   bw (  KiB/s): min= 7472, max=13712, per=100.00%, avg=11690.29, stdev=938.48, samples=119
   iops        : min= 1868, max= 3428, avg=2922.57, stdev=234.62, samples=119
  lat (usec)   : 100=44.45%, 250=50.94%, 500=3.22%, 750=0.57%, 1000=0.17%
  lat (msec)   : 2=0.48%, 4=0.16%, 10=0.01%, 50=0.01%
  cpu          : usr=1.84%, sys=7.74%, ctx=350841, majf=0, minf=11
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=175579,175262,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
   READ: bw=11.4MiB/s (12.0MB/s), 11.4MiB/s-11.4MiB/s (12.0MB/s-12.0MB/s), io=686MiB (719MB), run=60001-60001msec
  WRITE: bw=11.4MiB/s (12.0MB/s), 11.4MiB/s-11.4MiB/s (12.0MB/s-12.0MB/s), io=685MiB (718MB), run=60001-60001msec

Disk stats (read/write):
  sdd: ios=175242/174992, sectors=1401936/1400088, merge=0/17, ticks=40361/14859, in_queue=55227, util=88.82%